<a href="https://colab.research.google.com/github/sakshipatel2702/Machine_Learning/blob/main/Assign01_Sakshi_N01551583.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment 01 ( Submission Deadline : 22nd Jan 2023 )

## There are four questions in this Assignment. Run the code and explain what each cell of code is doing. You can add more cells when needed. Write your name and ID. Double click on the student name and ID to write your name and ID.

# Student Name : Sakshi Rushi Patel

# Student ID : N01551583

In [ ]:
import pandas as pd
import numpy as np

**ANSWER:**
To basically import pandas an open source package into your Python env., 
use the **`import pandas as pd`** syntax.

And **`import numpy as np`** helps us to import NumPy package in your Python enviornment. This package is typically used for all scientific computations.

# Q # 1 

# Run the program and explain what each step of program is doing ?

In [ ]:
n = 5
k = 0
for i in range(n):
    for j in range(n-k):
        print(n-k, end = " ")
    print(' ')
    k = k + 1

5 5 5 5 5
4 4 4 4
3 3 3
2 2
1

**ANSWER:**

1.   **`n = 5`** : It allots value 5 to the variable n. 

2.  **` k = 0`** : It allots value 0 to the variable k. 

3. **`for i in range(n):`** : In this line we have made a for loop using range function where range(stop) i.e range(n) and since n has value 5 the loop will stop at 0,1,2,3,4 i.e it stops at -1 from the value of stop in the range function. Thus if we `print(i)`we will get 0,1,2,3,4 and if we print(n) it will print 5,5,5,5,5.

4. **`for j in range(n-k):`** This is another for loop in which j is assigned value using range function where range(n-k) i.e range(5-0) so it will perform subtraction and the answer will be range(5). Hence it will run for 0,1,2,3,4 for the first time when value of k is 0.

5. **`print(n-k, end = " ")`** : This particular code is in the second for loop so it will when the value of k is 0 and the range is 5 in first loop then it will print 5 5 5 5 5 then when it goes to `k=k+1` it updates the value of k from 0 to 1 so then for the second time it will print 4 4 4 4 then again it will update the value of k from 1 to 2 and will print 3 3 3 and then again update the value of k from 2 to 3 and will print 2 2 and again updated value of k from 3 to 4 and which will be 5-4 and finally print 1.
Output: 
5 5 5 5 5
4 4 4 4
3 3 3
2 2
1

6. **`print(' ')`** : This will print on a new line 

7. **`k = k + 1`** : And this will update the value of k in the first for loop every time it runs as mentioned in the 5th point.

# Q # 2 

#  Explain what each coding cell id generating ?

In [ ]:
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
even = []
odd = []

**`ANSWER: `**


1.   `numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]` : It will assign array containing the numbers: [1,2,3,4,5,6,7,8,9] to variable numbers.

2.   `even = []` : We are assigning an empty array to variable named even.

3. `odd = []` : We are assigning an empty array to variable named odd.

In [ ]:
for num in numbers:
    if num % 2 == 0:
        even.append(num)
    else:
        odd.append(num)

**ANSWER:**


1.   `for num in numbers:` : We have created a for loop in which variable **num** will be assigned values present in **numbers** array.

2.  ` if num % 2 == 0:` : Then we have used **if..else loop** inside the **for loop** in which we are checking here if the value of num is divided by 2 and the remainder is equals to 0.

3. `even.append(num)` : Then if the **if statement is true** we will add that value in **num** variable to the variable **even** by using the **append function** which will be the array of even numbers from the array numbers.

4. `else:` : If the **if statement is false** then it will go to the else loop.

5. `odd.append(num)` : So after it goes **inside the else loop** the value inside the variable **num** will get added using the **append function to the odd array** which has all the values whoes remainder was not 0 when it was divided by 2.

In [ ]:
print("Numbers of even numbers : {}".format(len(even)))
print("Numbers of odd numbers : {}".format(len(odd)))

Numbers of even numbers : 4
Numbers of odd numbers : 5

**ANSWER:** 


1.   `print("Numbers of even numbers : {}".format(len(even)))` : This statement will print the total length of an array in even variable. In this case the length of the variable even is 4.

2.   `print("Numbers of odd numbers : {}".format(len(odd)))` : This statement will print the total length of an array in odd variable. In this case the length of the variable odd is 5.

# Q # 3

# Explain what each step of code is doing.

In [ ]:
for x in range(2,100):
   a = 0 
   for y in range(2,100): 
        
        if (x % y) == 0.0:
         a = a + 1
   if a == 1:
     print(x)

2
3
5
7
11
13
17
19
23
29
31
37
41
43
47
53
59
61
67
71
73
79
83
89
97

**ANSWER:**


1.  ` for x in range(2,100):` : We are running a for loop here in which variable **x will have the values from 2 to 99** as we have mentioned range(start,stop) i.e range(2,100) so the loop will start from 2 to 99 as it always stops at -1.
  
2.   `a = 0 ` : Here we have assigned value 0 to variable a.

3.   `for y in range(2,100): ` : We have created another **for loop** inside the first for loop here we are assigning variable y will values from 2 to 99 as we have range(2,100).

4.   `if (x % y) == 0.0:` : Inside the for loop we have an **if statement** and it will check the condition **if we get 0.0 in remainder if we divide value in x variable to value to y variable**. If the condition is true it will go inside the loop and perform tasks.

5. `a = a + 1` : If we get remainder 0 when dividing x to y then it will **increament the value of a by 1** as we have a = a + 1.

6. `if a == 1:` We have used another if loop here and here we will check the condition if the value of **variable a is equal to 1** and if its true it will run the command in that if loop.

7. `print(x)` : And if the if loop statement returns true then we will **print the value stored in x variable**.

# Q # 4

# By running a code below, you will get the df. Remove the rows of df containg "NaN" or " ? " .

In [ ]:
df = pd.DataFrame({"name":["William","Emma","Sofia","Markus","Edward","Thomas","Ethan","Olivia","Arun","Anika","Paulo"]
,"region":["East",np.nan,"East","South","West","West","South","West","West","East","South"]
,"sales":[50000,52000,90000,np.nan,42000,72000,49000,np.nan,67000,65000,67000]
,"expenses":[42000,43000,np.nan,44000,38000,39000,42000,np.nan,39000,44000,45000]
,"lossValues":[12000,'?','?',np.nan,11000,33000,44000,10000,22000,30000,99000]})

df

       name region    sales  expenses lossValues
0   William   East  50000.0   42000.0      12000
1      Emma    NaN  52000.0   43000.0          ?
2     Sofia   East  90000.0       NaN          ?
3    Markus  South      NaN   44000.0        NaN
4    Edward   West  42000.0   38000.0      11000
5    Thomas   West  72000.0   39000.0      33000
6     Ethan  South  49000.0   42000.0      44000
7    Olivia   West      NaN       NaN      10000
8      Arun   West  67000.0   39000.0      22000
9     Anika   East  65000.0   44000.0      30000
10    Paulo  South  67000.0   45000.0      99000

**ANSWER:**
This will create a df and print it with the "NaN" or "?" values

In [ ]:
df = df.dropna()
df

       name region    sales  expenses lossValues
0   William   East  50000.0   42000.0      12000
4    Edward   West  42000.0   38000.0      11000
5    Thomas   West  72000.0   39000.0      33000
6     Ethan  South  49000.0   42000.0      44000
8      Arun   West  67000.0   39000.0      22000
9     Anika   East  65000.0   44000.0      30000
10    Paulo  South  67000.0   45000.0      99000

**ANSWER:**
First we have to make sure that we have imported pandas to our python enviornment and using `df = df.dropna()` will help remove all the rows which would have "NaN" or "?" values in their dataset. And df will simply print the df.